# Data Frame

In [2]:
import pandas as pd
import numpy as np

In [3]:
# random normal distribution
data = np.random.randn(4,3)

In [4]:
dataFrame = pd.DataFrame(data)

In [5]:
dataFrame[0]
type(dataFrame[0])
dataFrame

          0         1         2
0  0.729636  0.139475  0.493600
1  1.073746 -0.929530  1.247626
2  0.174240  1.743324 -1.637547
3  0.352688  0.888867  1.716840

# Determining Row and Column

In [6]:
yeniDataFrame= pd.DataFrame(data,index=["Atil","Zeynep","Atlas","Mehmet"],columns= ["Maas","Yas","CalismaSaati"])
yeniDataFrame

            Maas       Yas  CalismaSaati
Atil    0.729636  0.139475      0.493600
Zeynep  1.073746 -0.929530      1.247626
Atlas   0.174240  1.743324     -1.637547
Mehmet  0.352688  0.888867      1.716840

# Column seçme

In [7]:
yeniDataFrame["Yas"]

Atil      0.139475
Zeynep   -0.929530
Atlas     1.743324
Mehmet    0.888867
Name: Yas, dtype: float64

In [8]:
# İki column için liste olarak yazılmalı ["Maas","Yas"]
yeniDataFrame[["Maas","Yas"]]

            Maas       Yas
Atil    0.729636  0.139475
Zeynep  1.073746 -0.929530
Atlas   0.174240  1.743324
Mehmet  0.352688  0.888867

# Satır Almak için .loc kullanılır

In [9]:
# Location
yeniDataFrame.loc["Atil"]

Maas            0.729636
Yas             0.139475
CalismaSaati    0.493600
Name: Atil, dtype: float64

In [10]:
# Index Location
yeniDataFrame.iloc[1]

Maas            1.073746
Yas            -0.929530
CalismaSaati    1.247626
Name: Zeynep, dtype: float64

In [11]:
yeniDataFrame

            Maas       Yas  CalismaSaati
Atil    0.729636  0.139475      0.493600
Zeynep  1.073746 -0.929530      1.247626
Atlas   0.174240  1.743324     -1.637547
Mehmet  0.352688  0.888867      1.716840

In [12]:
# Yeni Column Ekleme
yeniDataFrame["Emeklilik Yasi"] = yeniDataFrame["Yas"]*2
yeniDataFrame

            Maas       Yas  CalismaSaati  Emeklilik Yasi
Atil    0.729636  0.139475      0.493600        0.278950
Zeynep  1.073746 -0.929530      1.247626       -1.859060
Atlas   0.174240  1.743324     -1.637547        3.486648
Mehmet  0.352688  0.888867      1.716840        1.777734

# Column silmek istediğimizde axis belirtmeliyiz, belirtilmezse satırı siler

In [40]:
# Column Silme
yeniDataFrame.drop("Maas",axis=1)

                  Yas  CalismaSaati
Yeni Indeks
Ati          0.139475      0.493600
Zey         -0.929530      1.247626
Atl          1.743324     -1.637547
Meh          0.888867      1.716840

In [14]:
yeniDataFrame.drop("Mehmet")

            Maas       Yas  CalismaSaati  Emeklilik Yasi
Atil    0.729636  0.139475      0.493600        0.278950
Zeynep  1.073746 -0.929530      1.247626       -1.859060
Atlas   0.174240  1.743324     -1.637547        3.486648

# Data Frame üzerinde bir değişiklik yapsak (drop) bile dataframe değişmez. 

# Asıl dataframe'de bir değişiklik yapmak istiyorsak bunu belirtmeliyiz(inplace)

In [15]:
yeniDataFrame

            Maas       Yas  CalismaSaati  Emeklilik Yasi
Atil    0.729636  0.139475      0.493600        0.278950
Zeynep  1.073746 -0.929530      1.247626       -1.859060
Atlas   0.174240  1.743324     -1.637547        3.486648
Mehmet  0.352688  0.888867      1.716840        1.777734

In [16]:
yeniDataFrame.drop("Emeklilik Yasi",axis=1,inplace=True)
yeniDataFrame

            Maas       Yas  CalismaSaati
Atil    0.729636  0.139475      0.493600
Zeynep  1.073746 -0.929530      1.247626
Atlas   0.174240  1.743324     -1.637547
Mehmet  0.352688  0.888867      1.716840

# Index'ten belirli bir verinin çekilmesi

In [17]:
# iki şekilde bu işlemi yapabiliriz.
yeniDataFrame.loc["Atil"]["CalismaSaati"]

0.49359964992815164

In [18]:
# ikinci bir parantez açılmadan da yapılabilir
yeniDataFrame.loc["Atlas","Yas"]

1.7433239030843535

# Eşitsizlik ile Tabloyu yenilemek

In [19]:
yeniDataFrame < 0

         Maas    Yas  CalismaSaati
Atil    False  False         False
Zeynep  False   True         False
Atlas   False  False          True
Mehmet  False  False         False

In [20]:
# eşitsizliği sağlayan değeleri göstermeyi sağlar
booleanFrame = yeniDataFrame < 0
yeniDataFrame[booleanFrame]

        Maas      Yas  CalismaSaati
Atil     NaN      NaN           NaN
Zeynep   NaN -0.92953           NaN
Atlas    NaN      NaN     -1.637547
Mehmet   NaN      NaN           NaN

In [21]:
# Bu şekilde de yapılabilir.
yeniDataFrame[yeniDataFrame<0]

        Maas      Yas  CalismaSaati
Atil     NaN      NaN           NaN
Zeynep   NaN -0.92953           NaN
Atlas    NaN      NaN     -1.637547
Mehmet   NaN      NaN           NaN

In [22]:
yeniDataFrame["Yas"]>0

Atil       True
Zeynep    False
Atlas      True
Mehmet     True
Name: Yas, dtype: bool

In [23]:
# Yas kolonunda 0'dan büyük olanları alıp diğer satırları eleyebiliriz.
yeniDataFrame[yeniDataFrame["Yas"]>0]

            Maas       Yas  CalismaSaati
Atil    0.729636  0.139475      0.493600
Atlas   0.174240  1.743324     -1.637547
Mehmet  0.352688  0.888867      1.716840

In [24]:
yeniDataFrame

            Maas       Yas  CalismaSaati
Atil    0.729636  0.139475      0.493600
Zeynep  1.073746 -0.929530      1.247626
Atlas   0.174240  1.743324     -1.637547
Mehmet  0.352688  0.888867      1.716840

# Indexleri Değiştirme

In [25]:
# Indexlere numaralar ekler
yeniDataFrame.reset_index() # inplace=True eklenirse değişiklikler kaydedilir

    index      Maas       Yas  CalismaSaati
0    Atil  0.729636  0.139475      0.493600
1  Zeynep  1.073746 -0.929530      1.247626
2   Atlas  0.174240  1.743324     -1.637547
3  Mehmet  0.352688  0.888867      1.716840

In [26]:
#Normalde Atil, Zeynep Atlas silinmeli ve Ati, Zey, Atl yeni indexlerimiz olur.

In [27]:
yeniIndeksListesi=["Ati","Zey","Atl","Meh"]
yeniDataFrame["Yeni Indeks"] = yeniIndeksListesi
yeniDataFrame

            Maas       Yas  CalismaSaati Yeni Indeks
Atil    0.729636  0.139475      0.493600         Ati
Zeynep  1.073746 -0.929530      1.247626         Zey
Atlas   0.174240  1.743324     -1.637547         Atl
Mehmet  0.352688  0.888867      1.716840         Meh

In [28]:
# Yeni Index artık isimlerin yerini aldı
yeniDataFrame.set_index("Yeni Indeks",inplace=True)
yeniDataFrame

                 Maas       Yas  CalismaSaati
Yeni Indeks
Ati          0.729636  0.139475      0.493600
Zey          1.073746 -0.929530      1.247626
Atl          0.174240  1.743324     -1.637547
Meh          0.352688  0.888867      1.716840

In [29]:
yeniDataFrame.loc["Ati"]

Maas            0.729636
Yas             0.139475
CalismaSaati    0.493600
Name: Ati, dtype: float64

# Bir Büyük Index'in diğer Index'leri Kapsadığı Dataframe
# MultiIndex

In [30]:
ilkIndeksler= ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]
icIndeksler = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]
birlesmisIndeks= list(zip(ilkIndeksler,icIndeksler))
birlesmisIndeks

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [31]:
birlesmisIndeks= pd.MultiIndex.from_tuples(birlesmisIndeks)
birlesmisIndeks

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [32]:
benimFilmListem= [[40,"A"],[10,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]
filmNumpyDizisi= np.array(benimFilmListem)
# Oncelikle data, index, data,
cizgiFilmDataFrame=pd.DataFrame(filmNumpyDizisi,index=birlesmisIndeks,columns=["Yas","Meslek"])
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [33]:
cizgiFilmDataFrame.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   10      B
Marge  30      C

In [34]:
cizgiFilmDataFrame.loc["Simpson"].loc["Homer"]

Yas       40
Meslek     A
Name: Homer, dtype: object

In [35]:
# Indekslere Başlık Ekleme,
cizgiFilmDataFrame.index.names=["Film Adı","İsim"]
cizgiFilmDataFrame

                   Yas Meslek
Film Adı   İsim
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

# Pandas Excel

Excel dosyası kullandığımız python kodunun olduğu klasörün içine eklenmelidir.

In [ ]:
# bu komut ile excel dosyasını okuyabiliriz
pd.read_excel("dosyanin_adi.xlsx")
dataFrame.dropna()